<a href="https://colab.research.google.com/github/joachinhimself/joachinhimself/blob/main/august_ml_joachinhimself.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score
import math
import pandas as pd

In [2]:
df = pd.read_csv('/content/sample_data/realestate.csv')
df.head()

   No  X1 transaction date  ...  X6 longitude  Y house price of unit area
0   1             2012.917  ...     121.54024                        37.9
1   2             2012.917  ...     121.53951                        42.2
2   3             2013.583  ...     121.54391                        47.3
3   4             2013.500  ...     121.54391                        54.8
4   5             2012.833  ...     121.54245                        43.1

[5 rows x 8 columns]

In [3]:
df.head()

   No  X1 transaction date  ...  X6 longitude  Y house price of unit area
0   1             2012.917  ...     121.54024                        37.9
1   2             2012.917  ...     121.53951                        42.2
2   3             2013.583  ...     121.54391                        47.3
3   4             2013.500  ...     121.54391                        54.8
4   5             2012.833  ...     121.54245                        43.1

[5 rows x 8 columns]

In [4]:
df.drop(['No'],axis='columns', inplace=True)
df.drop(['X1 transaction date'], axis='columns' ,inplace=True)

In [5]:
df

     X2 house age  ...  Y house price of unit area
0            32.0  ...                        37.9
1            19.5  ...                        42.2
2            13.3  ...                        47.3
3            13.3  ...                        54.8
4             5.0  ...                        43.1
..            ...  ...                         ...
409          13.7  ...                        15.4
410           5.6  ...                        50.0
411          18.8  ...                        40.6
412           8.1  ...                        52.5
413           6.5  ...                        63.9

[414 rows x 6 columns]

In [6]:
df.shape

(414, 6)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 6 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   X2 house age                            414 non-null    float64
 1   X3 distance to the nearest MRT station  414 non-null    float64
 2   X4 number of convenience stores         414 non-null    int64
 3   X5 latitude                             414 non-null    float64
 4   X6 longitude                            414 non-null    float64
 5   Y house price of unit area              414 non-null    float64
dtypes: float64(5), int64(1)
memory usage: 19.5 KB

In [8]:
missing_values = df.isnull().sum()
missing_values

X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

In [9]:
df.describe()

       X2 house age  ...  Y house price of unit area
count    414.000000  ...                  414.000000
mean      17.712560  ...                   37.980193
std       11.392485  ...                   13.606488
min        0.000000  ...                    7.600000
25%        9.025000  ...                   27.700000
50%       16.100000  ...                   38.450000
75%       28.150000  ...                   46.600000
max       43.800000  ...                  117.500000

[8 rows x 6 columns]

In [10]:
realestate_X = df[["X2 house age"]]
realestate_y = df[["Y house price of unit area"]]

In [12]:
X_train, X_test, y_train, y_test = train_test_split(realestate_X,realestate_y,test_size=0.2,random_state=42 )

In [13]:
y_test.shape

(83, 1)

In [14]:
from sklearn.linear_model import LinearRegression
regr = LinearRegression()
regr.fit(X_train, y_train)
y_pred = regr.predict(X_test)

In [15]:
type(y_test)

pandas.core.frame.DataFrame

In [16]:
print("X_test - test X")
print(X_test[0:3])
print("y_test - actual")
print(y_test[0:3])
print("y_pred - model")
print(y_pred[0:3])

X_test - test X
     X2 house age
358           1.1
350          13.2
373           0.0
y_test - actual
     Y house price of unit area
358                        45.1
350                        42.3
373                        52.2
y_pred - model
[[42.59713414]
 [39.45375037]
 [42.8828963 ]]

In [17]:
print(regr.coef_)
print(regr.intercept_)

[[-0.25978378]]
[42.8828963]

In [18]:
print('Coefficients: \n', regr.coef_)
print(f"Mean squared error:{mean_squared_error(y_test, y_pred): .2f}")
print(f"Root Mean squared error: {math.sqrt(mean_squared_error(y_test, y_pred)) :.2f}")
print(f'Variance score: {r2_score(y_test, y_pred):.2f}')

Coefficients:
 [[-0.25978378]]
Mean squared error: 165.21
Root Mean squared error: 12.85
Variance score: 0.02